RT-Thread/rt-thread/bsp/apm32/libraries/APM32S10x_Library/Device/Geehy/APM32S10x/Include/apm32s10x.h
/* Includes */
#include "core_cm3.h"
#include "system_apm32s10x.h"
#include <stdint.h>

/** @defgroup Exported_Types
  @{
*/

typedef int32_t s32;
typedef int16_t s16;
typedef int8_t  s8;

typedef const int32_t sc32;
typedef const int16_t sc16;
typedef const int8_t sc8;

typedef __IO int32_t  vs32;
typedef __IO int16_t  vs16;
typedef __IO int8_t   vs8;

typedef __I int32_t vsc32;
typedef __I int16_t vsc16;
typedef __I int8_t vsc8;

typedef uint32_t  u32;
typedef uint16_t u16;
typedef uint8_t  u8;

typedef const uint32_t uc32;
typedef const uint16_t uc16;
typedef const uint8_t uc8;

typedef __IO uint32_t  vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t  vu8;

typedef __I uint32_t vuc32;
typedef __I uint16_t vuc16;
typedef __I uint8_t vuc8;

#ifndef __IM
#define __IM   __I
#endif
#ifndef __OM
#define __OM   __O
#endif
#ifndef __IOM
#define __IOM  __IO
#endif

enum {BIT_RESET, BIT_SET};
enum {RESET, SET};
enum {DISABLE, ENABLE};
enum {ERROR, SUCCESS};

#ifndef NULL
#define NULL   ((void *)0)
#endif

#if defined (__CC_ARM )
#pragma anon_unions
#endif

/**@} end of group Exported_types */

/** @defgroup Peripheral_registers_structures
  @{
*/

/*!
 * @brief Reset and clock management unit (RCM)
 */
typedef struct
{
    /* Clock control register */
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t HSIEN           : 1;
            __IM  uint32_t HSIRDYFLG       : 1;
            __IM  uint32_t RESERVED1       : 1;
            __IOM uint32_t HSITRIM         : 5;
            __IM  uint32_t HSICAL          : 8;
            __IOM uint32_t HSEEN           : 1;
            __IM  uint32_t HSERDYFLG       : 1;
            __IOM uint32_t HSEBCFG         : 1;
            __IOM uint32_t CSSEN           : 1;
            __IM  uint32_t RESERVED2       : 4;
            __IOM uint32_t PLLEN           : 1;
            __IM  uint32_t PLLRDYFLG       : 1;
            __IM  uint32_t RESERVED3       : 6;
        } CTRL_B;
    };

    /* Clock configuration register */
    union
    {
        __IOM uint32_t CFG;

        struct
        {
            __IOM uint32_t SCLKSEL         : 2;
            __IM  uint32_t SCLKSELSTS      : 2;
            __IOM uint32_t AHBPSC          : 4;
            __IOM uint32_t APB1PSC         : 3;
            __IOM uint32_t APB2PSC         : 3;
            __IOM uint32_t ADCPSC          : 2;
            __IOM uint32_t PLLSRCSEL       : 1;
            __IOM uint32_t PLLHSEPSC       : 1;
            __IOM uint32_t PLLMULCFG       : 4;
            __IOM uint32_t USBDPSC         : 2;
            __IOM uint32_t MCOSEL          : 3;
            __IOM uint32_t FPUPSC          : 1;
            __IM  uint32_t RESERVED        : 4;
        } CFG_B;
    } ;

    /* Clock interrupt control register */
    union
    {
        __IOM uint32_t INT;

        struct
        {
            __IM  uint32_t LSIRDYFLG       : 1;
            __IM  uint32_t LSERDYFLG       : 1;
            __IM  uint32_t HSIRDYFLG       : 1;
            __IM  uint32_t HSERDYFLG       : 1;
            __IM  uint32_t PLLRDYFLG       : 1;
            __IM  uint32_t RESERVED1       : 2;
            __IM  uint32_t CSSIF           : 1;
            __IOM uint32_t LSIRDYEN        : 1;
            __IOM uint32_t LSERDYEN        : 1;
            __IOM uint32_t HSIRDYEN        : 1;
            __IOM uint32_t HSERDYEN        : 1;
            __IOM uint32_t PLLRDYEN        : 1;
            __IM  uint32_t RESERVED2       : 3;
            __OM  uint32_t LSIRDYCLR       : 1;
            __OM  uint32_t LSERDYCLR       : 1;
            __OM  uint32_t HSIRDYCLR       : 1;
            __OM  uint32_t HSERDYCLR       : 1;
            __OM  uint32_t PLLRDYCLR       : 1;
            __IM  uint32_t RESERVED3       : 2;
            __OM  uint32_t CSSCLR          : 1;
            __IM  uint32_t RESERVED4       : 8;
        } INT_B;
    } ;

    /* APB2 peripheral reset register */
    union
    {
        __IOM uint32_t APB2RST;

        struct
        {
            __IOM uint32_t AFIO            : 1;
            __IM  uint32_t RESERVED1       : 1;
            __IOM uint32_t PA              : 1;
            __IOM uint32_t PB              : 1;
            __IOM uint32_t PC              : 1;
            __IOM uint32_t PD              : 1;
            __IOM uint32_t PE              : 1;
            __IM  uint32_t RESERVED2       : 2;
            __IOM uint32_t ADC1            : 1;
            __IOM uint32_t ADC2            : 1;
            __IOM uint32_t TMR1            : 1;
            __IOM uint32_t SPI1            : 1;
            __IM  uint32_t RESERVED3       : 1;
            __IOM uint32_t USART1          : 1;
            __IM  uint32_t RESERVED4       : 17;
        } APB2RST_B;
    } ;

    /* APB1 peripheral reset register */
    union
    {
        __IOM uint32_t APB1RST;

        struct
        {
            __IOM uint32_t TMR2            : 1;
            __IOM uint32_t TMR3            : 1;
            __IOM uint32_t TMR4            : 1;
            __IM  uint32_t RESERVED1       : 8;
            __IOM uint32_t WWDT            : 1;
            __IM  uint32_t RESERVED2       : 2;
            __IOM uint32_t SPI2            : 1;
            __IM  uint32_t RESERVED3       : 2;
            __IOM uint32_t USART2          : 1;
            __IOM uint32_t USART3          : 1;
            __IM  uint32_t RESERVED4       : 2;
            __IOM uint32_t I2C1            : 1;
            __IOM uint32_t I2C2            : 1;
            __IOM uint32_t USBD            : 1;
            __IM  uint32_t RESERVED5       : 1;
            __IOM uint32_t CAN1            : 1;
            __IM  uint32_t CAN2            : 1;
            __IOM uint32_t BAKP            : 1;
            __IOM uint32_t PMU             : 1;
            __IM  uint32_t RESERVED6       : 3;
        } APB1RST_B;
    } ;

    /* AHB clock enable register */
    union
    {
        __IOM uint32_t AHBCLKEN;

        struct
        {
            __IOM uint32_t DMA1            : 1;
            __IM  uint32_t RESERVED1       : 1;
            __IOM uint32_t SRAM            : 1;
            __IOM uint32_t FPU             : 1;
            __IOM uint32_t FMC             : 1;
            __IOM uint32_t QSPI            : 1;
            __IOM uint32_t CRC             : 1;
            __IM  uint32_t RESERVED2       : 25;
        } AHBCLKEN_B;
    } ;

    /* APB2 clock enable register */
    union
    {
        __IOM uint32_t APB2CLKEN;

        struct
        {
            __IOM uint32_t AFIO            : 1;
            __IM  uint32_t RESERVED1       : 1;
            __IOM uint32_t PA              : 1;
            __IOM uint32_t PB              : 1;
            __IOM uint32_t PC              : 1;
            __IOM uint32_t PD              : 1;
            __IOM uint32_t PE              : 1;
            __IM  uint32_t RESERVED2       : 2;
            __IOM uint32_t ADC1            : 1;
            __IOM uint32_t ADC2            : 1;
            __IOM uint32_t TMR1            : 1;
            __IOM uint32_t SPI1            : 1;
            __IM  uint32_t RESERVED3       : 1;
            __IOM uint32_t USART1          : 1;
            __IM  uint32_t RESERVED4       : 17;
        } APB2CLKEN_B;
    };

    /* APB1 clock enable register */
    union
    {
        __IOM uint32_t APB1CLKEN;

        struct
        {
            __IOM uint32_t TMR2            : 1;
            __IOM uint32_t TMR3            : 1;
            __IOM uint32_t TMR4            : 1;
            __IM  uint32_t RESERVED1       : 8;
            __IOM uint32_t WWDT            : 1;
            __IM  uint32_t RESERVED2       : 2;
            __IOM uint32_t SPI2            : 1;
            __IM  uint32_t RESERVED3       : 2;
            __IOM uint32_t USART2          : 1;
            __IOM uint32_t USART3          : 1;
            __IM  uint32_t RESERVED4       : 2;
            __IOM uint32_t I2C1            : 1;
            __IOM uint32_t I2C2            : 1;
            __IOM uint32_t USBD            : 1;
            __IM  uint32_t RESERVED5       : 1;
            __IOM uint32_t CAN1            : 1;
            __IM  uint32_t CAN2            : 1;
            __IOM uint32_t BAKP            : 1;
            __IOM uint32_t PMU             : 1;
            __IM  uint32_t RESERVED6       : 3;
        } APB1CLKEN_B;
    } ;

    /* Backup domain control register */
    union
    {
        __IOM uint32_t BDCTRL;

        struct
        {
            __IOM uint32_t LSEEN           : 1;
            __IM  uint32_t LSERDYFLG       : 1;
            __IOM uint32_t LSEBCFG         : 1;
            __IM  uint32_t RESERVED1       : 5;
            __IOM uint32_t RTCSRCSEL       : 2;
            __IM  uint32_t RESERVED2       : 5;
            __IOM uint32_t RTCCLKEN        : 1;
            __IOM uint32_t BDRST           : 1;
            __IM  uint32_t RESERVED3       : 15;
        } BDCTRL_B;
    } ;

    /* Control/status register */
    union
    {
        __IOM uint32_t CSTS;

        struct
        {
            __IOM uint32_t LSIEN           : 1;
            __IM  uint32_t LSIRDYFLG       : 1;
            __IM  uint32_t RESERVED1       : 22;
            __IOM uint32_t RSTFLGCLR       : 1;
            __IM  uint32_t RESERVED2       : 1;
            __IOM uint32_t NRSTFLG         : 1;
            __IOM uint32_t PODRSTFLG       : 1;
            __IOM uint32_t SWRSTFLG        : 1;
            __IOM uint32_t IWDTRSTFLG      : 1;
            __IOM uint32_t WWDTRSTFLG      : 1;
            __IOM uint32_t LPWRRSTFLG      : 1;
        } CSTS_B;
    } ;
} RCM_T;

/*!
 * @brief General purpose I/O (GPIO)
 */
typedef struct
{
    /* Port configure register low */
    union
    {
        __IOM uint32_t CFGLOW;

        struct
        {
            __IOM uint32_t MODE0           : 2;
            __IOM uint32_t CFG0            : 2;
            __IOM uint32_t MODE1           : 2;
            __IOM uint32_t CFG1            : 2;
            __IOM uint32_t MODE2           : 2;
            __IOM uint32_t CFG2            : 2;
            __IOM uint32_t MODE3           : 2;
            __IOM uint32_t CFG3            : 2;
            __IOM uint32_t MODE4           : 2;
            __IOM uint32_t CFG4            : 2;
            __IOM uint32_t MODE5           : 2;
            __IOM uint32_t CFG5            : 2;
            __IOM uint32_t MODE6           : 2;
            __IOM uint32_t CFG6            : 2;
            __IOM uint32_t MODE7           : 2;
            __IOM uint32_t CFG7            : 2;
        } CFGLOW_B;
    } ;

