RT-Thread/rt-thread/bsp/apm32/libraries/APM32S10x_Library/Device/Geehy/APM32S10x/Include/apm32s10x.h
    /* Status register */
    union
    {
        __IM uint32_t STS;

        struct
        {
            __IM  uint32_t PSCUFLG         : 1;
            __IM  uint32_t CNTUFLG         : 1;
            __IM  uint32_t RESERVED        : 30;
        } STS_B;
    };
} IWDT_T;

/*!
 * @brief Serial peripheral interface(SPI)
 */
typedef struct
{
    /* Control register 1 */
    union
    {
        __IOM uint32_t CTRL1;

        struct
        {
            __IOM uint32_t CPHA            : 1;
            __IOM uint32_t CPOL            : 1;
            __IOM uint32_t MSMCFG          : 1;
            __IOM uint32_t BRSEL           : 3;
            __IOM uint32_t SPIEN           : 1;
            __IOM uint32_t LSBSEL          : 1;
            __IOM uint32_t ISSEL           : 1;
            __IOM uint32_t SSEN            : 1;
            __IOM uint32_t RXOMEN          : 1;
            __IOM uint32_t DFLSEL          : 1;
            __IOM uint32_t CRCNXT          : 1;
            __IOM uint32_t CRCEN           : 1;
            __IOM uint32_t BMOEN           : 1;
            __IOM uint32_t BMEN            : 1;
            __IM  uint32_t RESERVED        : 16;
        } CTRL1_B;
    };

    /* Control register 2 */
    union
    {
        __IOM uint32_t CTRL2;

        struct
        {
            __IOM uint32_t RXDEN           : 1;
            __IOM uint32_t TXDEN           : 1;
            __IOM uint32_t SSOEN           : 1;
            __IM  uint32_t RESERVED1       : 2;
            __IOM uint32_t ERRIEN          : 1;
            __IOM uint32_t RXBNEIEN        : 1;
            __IOM uint32_t TXBEIEN         : 1;
            __IM  uint32_t RESERVED2       : 24;
        } CTRL2_B;
    };

    /* Status register */
    union
    {
        __IOM uint32_t STS;

        struct
        {
            __IM  uint32_t RXBNEFLG        : 1;
            __IM  uint32_t TXBEFLG         : 1;
            __IM  uint32_t SCHDIR          : 1;
            __IM  uint32_t UDRFLG          : 1;
            __IOM uint32_t CRCEFLG         : 1;
            __IM  uint32_t MEFLG           : 1;
            __IM  uint32_t OVRFLG          : 1;
            __IM  uint32_t BSYFLG          : 1;
            __IM  uint32_t RESERVED        : 24;
        } STS_B;
    };

    /* Data register */
    union
    {
        __IOM uint32_t DATA;

        struct
        {
            __IOM uint32_t DATA            : 16;
            __IM  uint32_t RESERVED        : 16;
        } DATA_B;
    };

    /* CRC polynomial register */
    union
    {
        __IOM uint32_t CRCPOLY;

        struct
        {
            __IOM uint32_t CRCPOLY         : 16;
            __IM  uint32_t RESERVED        : 16;
        } CRCPOLY_B;
    };

    /* Receive CRC register */
    union
    {
        __IM uint32_t RXCRC;

        struct
        {
            __IM  uint32_t RXCRC           : 16;
            __IM  uint32_t RESERVED        : 16;
        } RXCRC_B;
    };

    /* Transmit CRC register */
    union
    {
        __IM uint32_t TXCRC;

        struct
        {
            __IM  uint32_t TXCRC           : 16;
            __IM  uint32_t RESERVED        : 16;
        } TXCRC_B;
    };
} SPI_T;

/*!
 * @brief Window watchdog (WWDT)
 */
typedef struct
{

    /* Control register */
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t CNT             : 7;
            __IOM uint32_t WWDTEN          : 1;
            __IM  uint32_t RESERVED        : 24;
        } CTRL_B;
    };

    /* Configure register */
    union
    {
        __IOM uint32_t CFG;

        struct
        {
            __IOM uint32_t WIN             : 7;
            __IOM uint32_t TBPSC           : 2;
            __IOM uint32_t EWIEN           : 1;
            __IM  uint32_t RESERVED        : 22;
        } CFG_B;
    };

    /* Status register */
    union
    {
        __IOM uint32_t STS;

        struct
        {
            __IOM uint32_t EWIFLG          : 1;
            __IM  uint32_t RESERVED        : 31;
        } STS_B;
    };
} WWDT_T;

/*!
 * @brief Queued serial peripheral interface(QSPI)
 */
typedef struct
{
    /*! @brief Control register 1 */
    union
    {
        __IOM uint32_t CTRL1;
        struct
        {
            __IOM uint32_t DFS             : 5;
            __IM  uint32_t RESERVED1       : 3;
            __IOM uint32_t CPHA            : 1;
            __IOM uint32_t CPOL            : 1;
            __IOM uint32_t TXMODE          : 2;
            __IM  uint32_t RESERVED2       : 2;
            __IOM uint32_t SSTEN           : 1;
            __IM  uint32_t RESERVED3       : 7;
            __IOM uint32_t FRF             : 2;
            __IM  uint32_t RESERVED4       : 8;
        } CTRL1_B;
    };

    /*! @brief Control register 2 */
    union
    {
        __IOM uint32_t CTRL2;
        struct
        {
            __IOM uint32_t NDF             : 16;
            __IM  uint32_t RESERVED        : 16;
        } CTRL2_B;
    };

    /*! @brief QSPI Enable register */
    union
    {
        __IOM uint32_t SSIEN;
        struct
        {
            __IOM uint32_t EN              : 1;
            __IM  uint32_t RESERVED        : 31;
        } SSIEN_B;
    };

    __IM  uint32_t RESERVED;

    /*! @brief QSPI Slave enable register */
    union
    {
        __IOM uint32_t SLAEN;
        struct
        {
            __IOM uint32_t SLAEN           : 1;
            __IM  uint32_t RESERVED        : 31;
        } SLAEN_B;
    };

    /*! @brief Baudrate register */
    union
    {
        __IOM uint32_t BR;
        struct
        {
            __IOM uint32_t CLKDIV          : 16;
            __IM  uint32_t RESERVED        : 16;
        } BR_B;
    };

    /*! @brief Transmission FIFO threshhold level register */
    union
    {
        __IOM uint32_t TFTL;
        struct
        {
            __IOM uint32_t TFT             : 3;
            __IM  uint32_t RESERVED1       : 13;
            __IOM uint32_t TFTH            : 3;
            __IM  uint32_t RESERVED2       : 13;
        } TFTL_B;
    };

    /*! @brief Reception FIFO threshhold level register */
    union
    {
        __IOM uint32_t RFTL;
        struct
        {
            __IOM uint32_t RFT             : 3;
            __IM  uint32_t RESERVED        : 29;
        } RFTL_B;
    };

    /*! @brief Transmission FIFO level register */
    union
    {
        __IOM uint32_t TFL;
        struct
        {
            __IOM uint32_t TFL             : 3;
            __IM  uint32_t RESERVED        : 29;
        } TFL_B;
    };

    /*! @brief Reception FIFO level register */
    union
    {
        __IOM uint32_t RFL;
        struct
        {
            __IOM uint32_t RFL             : 3;
            __IM  uint32_t RESERVED        : 29;
        } RFL_B;
    };

    /*! @brief Status register */
    union
    {
        __IOM uint32_t STS;
        struct
        {
            __IOM uint32_t BUSYF           : 1;
            __IOM uint32_t TFNF            : 1;
            __IOM uint32_t TFEF            : 1;
            __IOM uint32_t RFNEF           : 1;
            __IOM uint32_t RFFF            : 1;
            __IM  uint32_t RESERVED1       : 1;
            __IOM uint32_t DCEF            : 1;
            __IM  uint32_t RESERVED2       : 25;
        } STS_B;
    };

