RT-Thread/rt-thread/bsp/apm32/libraries/APM32S10x_Library/Device/Geehy/APM32S10x/Include/apm32s10x.h
    /*! @brief Interrupt enable register */
    union
    {
        __IOM uint32_t INTEN;
        struct
        {
            __IOM uint32_t TFEIE           : 1;
            __IOM uint32_t TFOIE           : 1;
            __IOM uint32_t RFUIE           : 1;
            __IOM uint32_t RFOIE           : 1;
            __IOM uint32_t RFFIE           : 1;
            __IOM uint32_t MSTIE           : 1;
            __IM  uint32_t RESERVED        : 26;
        } INTEN_B;
    };

    /*! @brief Interrupt status register */
    union
    {
        __IM uint32_t ISTS;
        struct
        {
            __IM  uint32_t TFEIF           : 1;
            __IM  uint32_t TFOIF           : 1;
            __IM  uint32_t RFUIF           : 1;
            __IM  uint32_t RFOIF           : 1;
            __IM  uint32_t RFFIF           : 1;
            __IM  uint32_t MSTIF           : 1;
            __IM  uint32_t RESERVED        : 26;
        } ISTS_B;
    };

    /*! @brief Raw interrupt register */
    union
    {
        __IM uint32_t RIS;
        struct
        {
            __IM  uint32_t TFEIF           : 1;
            __IM  uint32_t TFOIF           : 1;
            __IM  uint32_t RFUIF           : 1;
            __IM  uint32_t RXOIR           : 1;
            __IM  uint32_t RXFIR           : 1;
            __IM  uint32_t MSTIR           : 1;
            __IM  uint32_t RESERVED        : 26;
        } RIS_B;
    };

    /*! @brief Transmission FIFO overflow interrupt clear register */
    union
    {
        __IM uint32_t TFOIC;
        struct
        {
            __IM  uint32_t TFOIC           : 1;
            __IM  uint32_t RESERVED        : 31;
        } TFOIC_B;
    };

    /*! @brief Reception FIFO overflow interrupt clear register */
    union
    {
        __IM uint32_t RFOIC;
        struct
        {
            __IM  uint32_t RFOIC           : 1;
            __IM  uint32_t RESERVED        : 31;
        } RFOIC_B;
    };

    /*! @brief Reception FIFO underflow interrupt clear register */
    union
    {
        __IM uint32_t RFUIC;
        struct
        {
            __IM  uint32_t RFUIC           : 1;
            __IM  uint32_t RESERVED        : 31;
        } RFUIC_B;
    };

    /*! @brief Master interrupt clear register */
    union
    {
        __IM uint32_t MIC;
        struct
        {
            __IM  uint32_t MIC             : 1;
            __IM  uint32_t RESERVED        : 31;
        } MIC_B;
    };

    /*! @brief Interrupt clear register */
    union
    {
        __IM uint32_t ICF;
        struct
        {
            __IM  uint32_t ICF             : 1;
            __IM  uint32_t RESERVED        : 31;
        } ICF_B;
    };

    __IM  uint32_t RESERVED1[5];

    /*! @brief Data register */
    union
    {
        __IOM uint32_t DATA;
        struct
        {
            __IOM  uint32_t DATA           : 32;
        } DATA_B;
    };

    __IM  uint32_t RESERVED2[35];

    /*! @brief Reception sample register */
    union
    {
        __IOM uint32_t RSD;
        struct
        {
            __IOM uint32_t RSD             : 8;
            __IM  uint32_t RESERVED1       : 8;
            __IOM uint32_t RSE             : 1;
            __IM  uint32_t RESERVED2       : 15;
        } RSD_B;
    };

    /*! @brief Reception sample register */
    union
    {
        __IOM uint32_t CTRL3;
        struct
        {
            __IOM uint32_t IAT             : 2;
            __IOM uint32_t ADDRLEN         : 4;
            __IM  uint32_t RESERVED1       : 2;
            __IOM uint32_t INSLEN          : 2;
            __IM  uint32_t RESERVED2       : 1;
            __IOM uint32_t WAITCYC         : 5;
            __IM  uint32_t RESERVED3       : 14;
            __IOM uint32_t CSEN            : 1;
            __IM  uint32_t RESERVED4       : 1;
        } CTRL3_B;
    };

    __IM  uint32_t  RESERVED3[66];

    /*! @brief IO switch register */
    union
    {
        __IOM uint32_t IOSW;
        struct
        {
            __IOM uint32_t IOSW            : 1;
            __IM  uint32_t RESERVED        : 31;
        } IOSW_B;
    };
} QSPI_T;

/*!
 * @brief Debug MCU(DBGMCU)
 */
typedef struct
{
    /*! @brief ID register */
    union
    {
        __IOM uint32_t IDCODE;
        struct
        {
            __IOM uint32_t EQR             : 12;
            __IM  uint32_t RESERVED        : 4;
            __IOM uint32_t WVR             : 16;
        } IDCODE_B;
    };

    /*! @brief Control register */
    union
    {
        __IOM uint32_t CFG;
        struct
        {
            __IOM uint32_t SLEEP_CLK_STS   : 1;
            __IOM uint32_t STOP_CLK_STS    : 1;
            __IOM uint32_t STANDBY_CLK_STS : 1;
            __IM  uint32_t RESERVED1       : 2;
            __IOM uint32_t TRACE_IOEN      : 1;
            __IOM uint32_t TRACE_MODE      : 2;
            __IOM uint32_t IWDT_STS        : 1;
            __IOM uint32_t WWDT_STS        : 1;
            __IOM uint32_t TMR1_STS        : 1;
            __IOM uint32_t TMR2_STS        : 1;
            __IOM uint32_t TMR3_STS        : 1;
            __IOM uint32_t TMR4_STS        : 1;
            __IOM uint32_t CAN1_STS        : 1;
            __IOM uint32_t I2C1_SMBUS_TIMEOUT_STS : 1;
            __IOM uint32_t I2C2_SMBUS_TIMEOUT_STS : 1;
            __IM  uint32_t RESERVED2       : 4;
            __IOM uint32_t CAN2_STS        : 1;
            __IM  uint32_t RESERVED3       : 10;
        } CFG_B;
    };
} DBGMCU_T;

/*!
 * @brief   USB Device controler(USBD)
 */
typedef union
{
    __IOM uint32_t EP;

    struct
    {
        __IOM uint32_t ADDR                : 4;
        __IOM uint32_t TXSTS               : 2;
        __IOM uint32_t TXDTOG              : 1;
        __IOM uint32_t CTFT                : 1;
        __IOM uint32_t KIND                : 1;
        __IOM uint32_t TYPE                : 2;
        __IOM uint32_t SETUP               : 1;
        __IOM uint32_t RXSTS               : 2;
        __IOM uint32_t RXDTOG              : 1;
        __IOM uint32_t CTFR                : 1;
        __IM  uint32_t RESERVED            : 16;
    } EP_B;
} USBD_EP_REG_T;

typedef struct
{
    /* Endpoint */
    USBD_EP_REG_T EP[8];

